app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5)  [["post_id", 1], ["post_id", 4], ["post_id", 6], ["post_id", 7], ["post_id", 10]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 1]]
---

    <div>Comments: <%= post.comments.size %>, Likes: <%= post.likes.size %></div>