app/views/posts/show.html.erb

<div class="row border border-1 mt-2" >
   <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]