app/controllers/api_controller.rb

  def index_posts
    render json: Post.all
---
SELECT "posts".* FROM "posts"

  def post_comments
    render json: Comment.where(post_id: params[:post_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", nil]]