app/controllers/likes_controller.rb

  def create
    @current_user = User.find(params[:user_id])
    @user_id = params[:user_id]
    @post_id = params[:post_id]
    if liked?
      flash[:notice] = 'You already liked this post'
      redirect_to user_post_path(@user_id, @post_id)
      return
    else
      Like.create(author_id: @current_user.id, post_id: @post_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("created_at", "updated_at", "user_id", "post_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2022-05-05 11:54:53.768577"], ["updated_at", "2022-05-05 11:54:53.768577"], ["user_id", 1], ["post_id", 1]]

  def liked?
    Like.find_by(author_id: @current_user.id, post_id: @post_id).present?
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."post_id" = $2 LIMIT $3  [["user_id", 1], ["post_id", 1], ["LIMIT", 1]]