app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5)  [["post_id", 1], ["post_id", 4], ["post_id", 6], ["post_id", 7], ["post_id", 10]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
---
  def index
    @user = User.find(params[:user_id])
    @posts = @user.posts.includes(:comments)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @post = Post.find(params[:id])
    @user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "text", "comments_counter", "likes_counter", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "dgfsdfs"], ["text", "sdfsdf"], ["comments_counter", 0], ["likes_counter", 0], ["created_at", "2022-05-11 15:40:40.133708"], ["updated_at", "2022-05-11 15:40:40.133708"], ["user_id", 1]]
---
  def create
    @current_user = User.find(params[:user_id])
    post = Post.new(post_params.merge(user_id: @current_user.id, comments_counter: 0, likes_counter: 0))
    if post.valid?
      post.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
    @current_user = current_user
    @user = User.find_by(id: params[:user_id])
    @post = @user.posts.find_by(id: params[:id])
    @post.destroy