app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC
---
  def index
    @user = current_user
    @users = User.order(:id)