app/models/comment.rb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 3]]
UPDATE "posts" SET "comments_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["comments_counter", 2], ["updated_at", "2022-05-05 12:02:59.514358"], ["id", 3]]
---
  def update_comments_counter
    post.update(comments_counter: post.comments.length)