app/models/like.rb

  def update_likes_counter
    post.update(likes_counter: post.likes.length)
---
SELECT "likes".* FROM "likes" WHERE "likes"."post_id" = $1  [["post_id", 4]]
UPDATE "posts" SET "likes_counter" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes_counter", 1], ["updated_at", "2022-05-05 12:01:26.958012"], ["id", 4]]