app/models/post.rb

  def update_posts_counter
    user.update(posts_counter: user.posts.length)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 1]]
UPDATE "users" SET "posts_counter" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["posts_counter", 5], ["updated_at", "2022-05-05 12:01:26.961197"], ["id", 1]]